plantalog/cadi-gcl/stm32f407/current/main.c
/*
* Use this code free of charge, but leave this text box
* This code is distributed as is with no warranties.
* plantalog.livejournal.com
*
*
*
*
*/

#include "stm32f4xx.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rtc.h"
#include "stm32f4xx_conf.h"
#include "stm32f4xx_flash.h"
#include "stm32f4xx_spi.h"
#include "eeprom.h"
#include "stm32f4_discovery.h"
#include "FreeRTOS.h"
#include "task.h"
#include "hd44780_lib.h"
#include "stdio.h"
#include "wireless_nrf24/nrf24_lib.h"
#include "hd44780_ear2earoak/hd44780.h"
#include "fatfs_easyelectronics/ff.h"
#include "fatfs_easyelectronics/mmc_stm32f4.h"
//#include "ff9a/src/diskio.h"
//#include "ff9a/src/ff.h"


uint8_t spi_irq_counter=0;


/*
*
*
*
*

/// SPI2 ///


PC2
SPI2_MISO /
OTG_HS_ULPI_DIR /
TH_MII_TXD2
/I2S2ext_SD/ EVENTOUT
ADC123_IN12


PC3
SPI2_MOSI / I2S2_SD /
OTG_HS_ULPI_NXT /
ETH_MII_TX_CLK/
EVENTOUT
ADC123_IN13

PB10
SPI2_SCK / I2S2_CK /
I2C2_SCL/ USART3_TX /
OTG_HS_ULPI_D3 /
ETH_MII_RX_ER /
TIM2_CH3/ EVENTOUT


PB12
SPI2_NSS / I2S2_WS /
I2C2_SMBA/
USART3_CK/ TIM1_BKIN /
CAN2_RX /
OTG_HS_ULPI_D5/
ETH_RMII_TXD0 /
ETH_MII_TXD0/
OTG_HS_ID/ EVENTOUT


PB13
SPI2_SCK / I2S2_CK /
USART3_CTS/
TIM1_CH1N /CAN2_TX /
OTG_HS_ULPI_D6 /
ETH_RMII_TXD1 /
ETH_MII_TXD1/
EVENTOUT
OTG_HS_V


PB14
SPI2_MISO/ TIM1_CH2N /
TIM12_CH1 /
OTG_HS_DM/
USART3_RTS /
TIM8_CH2N/I2S2ext_SD/
EVENTOUT

PB15
SPI2_MOSI / I2S2_SD/
TIM1_CH3N / TIM8_CH3N
/ TIM12_CH2 /
OTG_HS_DP/ EVENTOUT

PB9 I/O FT
SPI2_NSS/ I2S2_WS/
TIM4_CH4/ TIM11_CH1/
SDIO_D5 / DCMI_D7 /
I2C1_SDA / CAN1_TX/
EVENTOUT


/// SPI3 ///

PA15
(JTDI)
I/O FT
JTDI/ SPI3_NSS/
I2S3_WS/TIM2_CH1_ETR
/ SPI1_NSS / EVENTOUT


PC10 I/O FT
SPI3_SCK / I2S3_CK/
UART4_TX/SDIO_D2 /
DCMI_D8 / USART3_TX/
EVENTOUT


PC11 I/O FT
UART4_RX/ SPI3_MISO /
SDIO_D3 /
DCMI_D4/USART3_RX /
I2S3ext_SD/ EVENTOUT


PC12 I/O FT
UART5_TX/SDIO_CK /
DCMI_D9 / SPI3_MOSI
/I2S3_SD / USART3_CK/
EVENTOUT


PB3
(JTDO/
TRACESWO)
I/O FT
JTDO/ TRACESWO/
SPI3_SCK / I2S3_CK /
TIM2_CH2 / SPI1_SCK/
EVENTOUT

PB4
(NJTRST)
I/O FT
NJTRST/ SPI3_MISO /
TIM3_CH1 / SPI1_MISO /
I2S3ext_SD/ EVENTOUT

PB5 I/O FT
I2C1_SMBA/ CAN2_RX /
OTG_HS_ULPI_D7 /
ETH_PPS_OUT/TIM3_CH
2 / SPI1_MOSI/
SPI3_MOSI / DCMI_D10 /
I2S3_SD/ EVENTOUT


*
*



/// SPI1 ///

PA4
SPI1_NSS / SPI3_NSS /
USART2_CK /
DCMI_HSYNC /
OTG_HS_SOF/ I2S3_WS/
EVENTOUT
ADC12_IN4
/DAC1_OUT


PA5
SPI1_SCK/
OTG_HS_ULPI_CK /
TIM2_CH1_ETR/
TIM8_CHIN/ EVENTOUT
ADC12_IN5/
DAC2_OUT


PA6
SPI1_MISO /
TIM8_BKIN/TIM13_CH1 /
DCMI_PIXCLK / TIM3_CH1
/ TIM1_BKIN/EVENTOUT
ADC12_IN6

PA7
SPI1_MOSI/ TIM8_CH1N /
TIM14_CH1/TIM3_CH2/
ETH_MII_RX_DV /
TIM1_CH1N /
RMII_CRS_DV/
EVENTOUT
ADC12_IN7



/// TIM2 ///
*
*
* PB11
I2C2_SDA/USART3_RX/
OTG_HS_ULPI_D4 /
ETH_RMII_TX_EN/
ETH_MII_TX_EN /
TIM2_CH4/ EVENTOUT

*/


/*
* PA3
USART2_RX/TIM5_CH4 /
TIM9_CH2 / TIM2_CH4 /
OTG_HS_ULPI_D0 /
ETH_MII_COL/
EVENTOUT
*
*/




typedef struct
{
  uint16_t                         DHT_Temperature; // temperature
  uint16_t                         DHT_Humidity; // from 0 (0%) to 1000 (100%)
  uint8_t                         DHT_CRC; // from 0 (0%) to 1000 (100%)
  RTC_TimeTypeDef         Last_refresh;
}DHT_data;


#define BUTTON_RANGES_START_ADDR        0x0621        // button ranges (8 values in a row)
#define BUTTON_OK                                2
#define BUTTON_CNL                                3
#define BUTTON_BCK                                1
#define BUTTON_FWD                                4

#define DHT_TRIG_PLUG                        7                // PA7
#define DHT_DATA_START_POINTER        2                // sets the first bit number in captured sequence of DHT response bits


// analog inputs
#define JDR_BUTTONS        ADC1->JDR3                // continuous ADC channel for buttons
#define JDR_PH                ADC1->JDR1                // continuous ADC channel for pH

#define sonar_port                                GPIOA

#define sonar_echo_port                        GPIOA
#define sonar_trig_port                        GPIOA
#define sonar_pin_trig                        GPIO_Pin_11
#define sonar_pin_echo                        GPIO_Pin_13
#define sonarclk                                RCC_AHB1Periph_GPIOA
#define sonar_trig_clk                        RCC_AHB1Periph_GPIOA
#define sonar_echo_clk                        RCC_AHB1Periph_GPIOA

#define        sonar_EXTI_LINE EXTI_Line0
#define        sonar_port_source                EXTI_PortSourceGPIOA
#define        sonar_pin_source                EXTI_PinSource0
#define sonar_EXTI_IRQn                 EXTI0_IRQn
#define sonar_echo_timer                TIM2

#define LIGHT_RANGE_ADDR        0x7CFF        // the border for the light sensor trigger
#define EE_PLUG_SETTINGS        0x7D00
#define EE_TIMER1_ON                0x8000
// #define EE_CTIMER                        0x7E00
#define EE_CTIMER_DURATION        0x7E00
#define EE_CTIMER_INTERVAL        0x7E02
#define EE_TIMER_SIZE                10
#define EE_CTIMER_SIZE                5
#define PLUG_AMOUNT                        3                // this links to number of pins on PORTC, so not more then 16
#define LS2CT_ADDR                        0x7C00        // 64 tajmera tipa LS+2CT (16bit na tajmer)
#define        ADDLIGHT_ADDR                0x7C40        // 128 tajmerov dosveta (8 bit na tajmer)
#define        T2CT_ADDR                        0x7C80        // 63 tajmera tipa 1obychnyj+2ckilicheskih
#define PH4_ADDR                        0x0600
#define PH7_ADDR                        0x0601
#define PH_INTERVAL                        0x0602                // pH measurement interval in milliseconds
#define PH_BUFF_SIZE                0x0603                // pH buffer size
#define SD_LOG_INTERVAL                0x0620                // sd logging interval, seconds

// SD card defines
#define GO_IDLE_STATE 0
#define SEND_IF_COND 8
#define READ_SINGLE_BLOCK 17
#define WRITE_SINGLE_BLOCK 24
#define SD_SEND_OP_COND         41
#define APP_CMD                         55
#define READ_OCR                 58

#define CS_ENABLE GPIOB->BSRRL |= GPIO_Pin_5;
#define CS_DISABLE          GPIOB->BSRRH |= GPIO_Pin_5;


RTC_TimeTypeDef curtime;
RTC_DateTypeDef curdate;

uint8_t button_code = 0;

// sonar variables
uint16_t        sonar_ccnt=0;
uint16_t        sonar_value=0;
uint16_t        IC1Value[84];
uint16_t        IC2Value[84];


