plantalog/cadi-gcl/stm32f407/current/main.c
// digital humidity and temperature data
uint16_t dht_bit_array[50];
DHT_data DHTValue;
uint8_t                dht_data[5];
uint8_t dht_bit_position = 0;
uint8_t dht_bit_ready = 0;
uint8_t                dht_data_ready = 0;
uint8_t         dht_rh_str[4], dht_t_str[4];

// Real-time clock variables
uint8_t                rtc_time_now_str[16];


static uint8_t                sonar_str[5];
GPIO_InitTypeDef GPIO_InitStructure;
NVIC_InitTypeDef NVIC_InitStructure;
EXTI_InitTypeDef EXTI_InitStructure;
uint16_t        capture1=0, capture2=0;
volatile uint8_t capture_is_first = 1, capture_is_ready = 0;
volatile uint16_t systick_ms = 0;
TIM_ICInitTypeDef TIM_ICInitStructure;
/* Virtual address defined by the user: 0xFFFF value is prohibited */
uint16_t VirtAddVarTab[2] = {
                        EE_TIMER1_ON,
                        EE_CTIMER_DURATION
};
uint16_t button_ranges[8];        // 0,2,4,6 - lower, 1,3,5,7 - higher values for buttons
uint8_t buttonReverse=0;
uint16_t buttonBuffer[10];

// string data to display
static uint8_t LCDLine1[16], LCDLine2[16];                // framebuffer
static uint8_t lcd_pointerx=0, lcd_pointery=0;


uint8_t SDHC;
static FIL cadizlog;
uint8_t logString[64];

//// MIGRATED FROM F100 ////
uint8_t logInterval=0;
//RTC_Time toAdjust;
ErrorStatus HSEStartUpStatus;
FLASH_Status FlashStatus;
uint8_t no_sd;
FATFS fs;
uint16_t VarValue = 0;
uint16_t ph_seven=0;
uint32_t ph0=0;
uint16_t ph4=0;
int cdel=0;
uint16_t phBuffer[10];
char curphstr[5];
uint16_t phAdcValue;
uint32_t lastWriteTime=0;
//uint16_t ph_seven, ph4;
uint8_t lightSensor;
uint16_t lightRange;
uint32_t timerStateFlags, cTimerStateFlags;
uint32_t plugStateFlags;
uint8_t plugSettings[PLUG_AMOUNT] = {0, 1, 2};        // PLUG_AMOUNT - number of plugs HARDCODE
// elementy massiva - nomera tajmerov, sootvetstvujushih Plug'am.
// 0 element - pervyj plug, 1 element - plug no 2, etc

extern unsigned char nrfRxBuff[NRF24_RX_BUFF_SIZE];
extern unsigned char nrfTxBuff[NRF24_TX_BUFF_SIZE];
extern uint8_t nrf_rx_pointer, nrf_tx_pointer;


#define MENURECS        23

// menu items
const char menuItemArray[MENURECS][18]=
{
                {"MONITOR MODE"},                // 0
                {"TIMERS"},                                // 1
                {"Timer 1"},                        // 2
                {"Timer 2"},                        // 3
                {"Timer 3"},                        // 4
                {"SET CLOCK"},                        // 5
                {"CYCLIC TIMERS"},                        // 6
                {"Cyclic Timer 1"},                        // 7
                {"Cyclic Timer 2"},                        // 8
                {"Cyclic Timer 3"},                        // 9
                {"PLUG SETTINGS"},                        // 10
                {"Plug 1"},                        // 11
                {"Plug 2"},                        // 12
                {"Plug 3"},                        // 13
                {"pH-monitor"},                // 14
                {"Calibration"},        // 15
                {"pH-stabilizer"},        // 16
                {"DAYLIGHT SENSOR"},// 17
                {"COMBI TIMERS"},        // 18
                {"LS+2CT"},        // 19
                {"T+2CT"},        // 20
                {"Add Light"},        // 21
                {"Temp. & humidity"}        // 22

};

// 0 - nr zapisi, 1 - link na tekst, 2 - <, 3 - >, 4 - OK, 5 - CNCL, 6 - tip zapisi (0 - folder, 1 - program)
const int fatArray[MENURECS][7]=
{
                {0,        0,        22,        1,        1,        0,        1},
                {1,        1,        0,        5,        2,        1,        0},
                {2,        2,        4,        3,        2,        1,        1},
                {3,        3,        2,        4,        3,        1,        1},
                {4,        4,        3,        2,        4,        1,        1},
                {5,        5,        1,        6,        5,        5,        1},
                {6,        6,        5,        10,        7,        6,        0},
                {7,        7,        9,        8,        6,        6,        1},
                {8,        8,        7,        9,        7,        6,        1},
                {9,        9,        8,        7,        8,        6,        1},
                {10,10,        6,        14,        11,        10,        0},
                {11,11,        13,        12,        9,        10,        1},
                {12,12,        11,        13,        10,        10,        1},
                {13,13,        12,        11,        11,        10,        1},
                {14,14,        10,        17,        15,        14,        0},
                {15,15,        16,        16,        15,        14,        1},
                {16,16,        15,        15,        16,        14,        1},
                {17,17,        14,        18,        14,        17,        1},
                {18,18,        17,        22,        19,        18,        0},
                {19,19,        21,        20,        15,        19,        1},
                {20,20,        19,        21,        16,        20,        1},
                {21,21,        20,        19,        17,        21,        1},
                {22,22,        18,        0,        17,        22,        1}

};

//// EOF MIGRATED FROM F100 ////



void Lcd_write_str_fb(uc8 *STRING);
void dht_arr_displayer(void);
int menuSelector(void);
void programRunner(uint8_t programId);
void readButtonRanges(void);
void saveButtonRanges(void);
void loadSettings();
char* int32str(uint32_t d, char* out);
extern void EXTI15_10_IRQHandler(void);
extern void TIM2_IRQHandler(void);
static void TIM_Config(void);
void EXTI0_IRQHandler(void);
static void RTC_Config(void);
extern void RTC_WKUP_IRQHandler(void);
extern void TIM5_IRQHandler(void);
extern void Init_lcd(void);
extern void Lcd_write_arr(uc8 *STRING, uint8_t chars);
void buttonsInit(void);
FRESULT string2log(char* str, int a);
void buttonCalibration(void);
uint8_t readButtons(void);
void copy_arr(uint8_t *source, uint8_t *destination, uint8_t amount, uint8_t pos);
uint32_t EE_ReadWord(uint16_t Address);
void monitorDisplayer(void);
void flush_lcd_buffer(void);
void Lcd_go2(uint8_t y, uint8_t x);
void nrf24init(void);
void Lcd_print_digit(uint8_t numb);
void nrfTest(void);
void Lcd_write_digit(uint8_t numb);

void nfr24init2(void){

