plantalog/cadi-gcl/stm32f407/current/main.c
}

void Lcd_print_digit(uint8_t numb){
	if (numb<10) {
    	if (lcd_pointery==0) {
        	LCDLine1[lcd_pointerx++] = 48;
          	LCDLine1[lcd_pointerx++] = 48+numb;
     	}
      	else {
        	LCDLine2[lcd_pointerx++] = 48;
         	LCDLine2[lcd_pointerx++] = 48+numb;
     	}
	}
	else {
    	if (lcd_pointery==0) {
    		LCDLine1[lcd_pointerx++] = (numb/10)+48;
        	LCDLine1[lcd_pointerx++] = (numb-(numb/10)*10)+48;
    	}
    	else {
        	LCDLine2[lcd_pointerx++] = (numb/10)+48;
        	LCDLine2[lcd_pointerx++] = (numb-(numb/10)*10)+48;
    	}
	}
}

void Lcd_go2(uc8 y,uc8 x)
{
	lcd_pointery = y;
	lcd_pointerx = x;
}

void flush_lcd_buffer(void){
	Lcd_go2(0,0);
	uint8_t i=0;
	for (i=0;i<16;i++){
		LCDLine1[i]=32;
		LCDLine2[i]=32;
	}
}



void Lcd_write_str_fb(uc8 *STRING){
	char c;
	while (c=*STRING++){
		if (lcd_pointery==0) {
			LCDLine1[lcd_pointerx] = c;
			lcd_pointerx++;
		}
		else {
			LCDLine2[lcd_pointerx] = c;
			lcd_pointerx++;
		}
		// vTaskDelay(1);
	}

}


int menuSelector_f100(void)
{
	int curItem=0;	// default item to display entering the menu
	int programId = 0;
//	int buttonPressed=readButtons();
	int textId=fatArray[curItem][1];
	while (programId==0){
		textId=fatArray[curItem][1];
		Lcd_goto(0,0);
		Lcd_write_str(menuItemArray[textId]);
		int curButton=readButtons();
		if (curButton>0){
			vTaskDelay(100);
			Lcd_clear();
		}
		vTaskDelay(10);
		if (curButton==BUTTON_OK){
			if (fatArray[curItem][6]==1)		// run program
				{programId=fatArray[curItem][4];}
			else	{curItem=fatArray[curItem][4];}			// enter folder
			Lcd_clear();
		}
		else if (curButton==BUTTON_CNL){
			curItem=fatArray[curItem][5];
			Lcd_clear();
		}
		else if (curButton==BUTTON_BCK){
			curItem=fatArray[curItem][2];
			Lcd_clear();
		}
		else if (curButton==BUTTON_FWD){
			curItem=fatArray[curItem][3];
			Lcd_clear();
		}
	}
	vTaskDelay(1);
	return(programId);
}

// function returns the programId selected in menu to run the program
int menuSelector(void)
{
        int curItem=0;        // default item to display entering the menu
        int programId = 0;
//        int buttonPressed=readButtons();
        int textId=fatArray[curItem][1];
        while (programId==0){
                textId=fatArray[curItem][1];
                Lcd_go2(0,0);
                Lcd_write_str_fb(menuItemArray[textId]);
     /*           if (button_code>0){
                        vTaskDelay(100);
                        Lcd_clear();
                } */
                vTaskDelay(10);
                if (button_code==BUTTON_OK){
                        if (fatArray[curItem][6]==1)                // run program
                                {programId=fatArray[curItem][4];}
                        else        {curItem=fatArray[curItem][4];}                        // enter folder
                        Lcd_clear();
                }
                else if (button_code==BUTTON_CNL){
                        curItem=fatArray[curItem][5];
                        Lcd_clear();
                }
                else if (button_code==BUTTON_BCK){
                        curItem=fatArray[curItem][2];
                        Lcd_clear();
                }
                else if (button_code==BUTTON_FWD){
                        curItem=fatArray[curItem][3];
                        Lcd_clear();
                }

        }
        vTaskDelay(1);
        return(programId);
}

void programRunner(uint8_t programId){
        uint32_t tmp;
        switch (programId) {
        case 1:
                break;
        case 2:
         		nrfTest();
                break;
  /*        case 3:

                setTimer(1);
                break;
        case 4:
                setTimer(2);
                break;
        case 5:
                tmp = RTC_GetCounter();
                uint32_t unixtime = timeAdjust(tmp, 1);
                RTC_SetCounter(unixtime);
                Lcd_clear();
                break;
        case 6:
         setCTimer(0);
                break;
        case 7:
                setCTimer(1);
                break;
        case 8:
                setCTimer(2);
                break;
        case 9:
                setPlug(0);
                break;
        case 10:
                setPlug(1);
                break;
        case 11:
                setPlug(2);
                break;
        case 13:
                phMonSettings();
                break;
        case 14:
                lightRangeSet();
                break;
        case 15:
                calibratePh();
                break;
        case 16:
                phStabSettings();
                break;
                */
        case 17:
                dht_arr_displayer();
                displayAdcValues();
//                setDutyCycle();
                break;
        }
}


void buttonsInit(void) {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN; //

        GPIOA->MODER |= (GPIO_MODER_MODER0 << (0 * 2)); //
        GPIOA->MODER |= (GPIO_MODER_MODER0 << (1 * 2)); //
        GPIOA->MODER |= (GPIO_MODER_MODER0 << (2 * 2)); //
        GPIOA->MODER |= (GPIO_MODER_MODER0 << (3 * 2)); //

        RCC->APB2ENR |= RCC_APB2ENR_ADC1EN; //
        ADC1->CR1 = 0; //
        ADC1->CR2 = 0; //
        ADC1->JSQR = 0;

        ADC1->CR2 = ADC_CR2_JEXTSEL; //
        ADC1->CR2 |= ADC_CR2_CONT; //
        ADC1->CR1 |= ADC_CR1_SCAN; //
        ADC1->CR1 |= ADC_CR1_JAUTO; //
        ADC1->JSQR = ((4-1)<<20); //number of channels in injected group
        ADC1->JSQR |= (0<<(5*3)); //ch. number for first conversion
        ADC1->JSQR |= (1<<(5*2)); //ch. number for 2nd conversion
        ADC1->JSQR |= (2<<(5*1)); //ch. number for 2nd conversion
        ADC1->JSQR |= (3<<(5*0)); //ch. number for 2nd conversion

        ADC1->CR2 |= ADC_CR2_ADON; //enable ADC
        ADC1->CR2 |= ADC_CR2_JSWSTART; //start conversion
}

void adc_read(void){
        ADC1->CR2 |= ADC_CR2_JSWSTART;
        while (!(ADC1->SR & ADC_SR_JEOC));
}

extern void RTC_WKUP_IRQHandler(void)
{
  if(RTC_GetITStatus(RTC_IT_WUT) != RESET)
  {
    /* Toggle on LED1 */
// STM_EVAL_LEDToggle(LED1);
    RTC_ClearITPendingBit(RTC_IT_WUT);
    EXTI_ClearITPendingBit(EXTI_Line22);
  }
}

/**
* @brief This function handles TIM5 global interrupt request.
* @param None
* @retval None
*/
extern void TIM5_IRQHandler(void)
{
  if (TIM_GetITStatus(TIM5, TIM_IT_CC4) != RESET)
  {
    /* Get the Input Capture value */
// tmpCC4[uwCaptureNumber++] = TIM_GetCapture4(TIM5);

