plantalog/cadi-gcl/stm32f407/current/main.c
    /* Clear CC4 Interrupt pending bit */
    TIM_ClearITPendingBit(TIM5, TIM_IT_CC4);

 // if (uwCaptureNumber >= 2)
 // {
      /* Compute the period length */
 // uwPeriodValue = (uint16_t)(0xFFFF - tmpCC4[0] + tmpCC4[1] + 1);
// }
  }
}


void vTaskLED5(void *pvParameters);
void vTaskLED6(void *pvParameters);
void vTaskLCDdraw(void *pvParameters);
void vTaskSonar(void *pvParameters);
void vTaskReadButtons(void *pvParameters);
void vTaskDHT(void *pvParameters);
void vTaskSDLog(void *pvParameters);
void vTaskProgramRunner(void *pvParameters);

void init_gpio(void){        // do we need it?
         GPIO_InitTypeDef gpio_cfg,GPIO_InitStructure;
         GPIO_StructInit(&gpio_cfg);

         // vyvod ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¨trigÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¨ signala
         RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);                // PB13
         gpio_cfg.GPIO_Mode = GPIO_Mode_OUT;
         gpio_cfg.GPIO_OType = GPIO_OType_PP;
         gpio_cfg.GPIO_PuPd = GPIO_PuPd_UP;
         gpio_cfg.GPIO_Pin = GPIO_Pin_13;
         GPIO_Init(GPIOB, &gpio_cfg);

         // TIM5 na PA3 dlja lovli "echo" s podschetom ego dliny
         GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
         GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
         GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
         GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
         GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
         GPIO_Init(GPIOB, &GPIO_InitStructure);
}

void dht_init(void){
         GPIO_InitTypeDef GPIO_InitStructure;
         NVIC_InitTypeDef NVIC_InitStructure;

         /* TIM4 clock enable */
         RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

         /* GPIOB clock enable */
         RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);

         /* TIM4 chennel2 configuration : PB.07 */
         GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
         GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
         GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
         GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
         GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP ;
         GPIO_Init(GPIOB, &GPIO_InitStructure);

         // CARD SELECT for SD card        // chto za porno????
         GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
         GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
         GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
         GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
         GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP ;
         GPIO_Init(GPIOB, &GPIO_InitStructure);

         /* Connect TIM pin to AF2 */
         GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_TIM4);

         /* Enable the TIM4 global Interrupt */
         NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;
         NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
         NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
         NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
         NVIC_Init(&NVIC_InitStructure);
        TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
         TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
         TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
         TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
         TIM_ICInitStructure.TIM_ICFilter = 0x0;

         TIM_PWMIConfig(TIM4, &TIM_ICInitStructure);

         /* Select the TIM4 Input Trigger: TI2FP2 */
         TIM_SelectInputTrigger(TIM4, TIM_TS_TI2FP2);

         /* Select the slave Mode: Reset Mode */
         TIM_SelectSlaveMode(TIM4, TIM_SlaveMode_Reset);
         TIM_SelectMasterSlaveMode(TIM4,TIM_MasterSlaveMode_Enable);

         /* Enable the CC2 Interrupt Request */
         TIM_ITConfig(TIM4, TIM_IT_CC2, ENABLE);
         /* TIM enable counter */
         TIM_Cmd(TIM4, ENABLE);

}

void dht_init_out(void){        // init GPIO pin as OUTput
         GPIO_InitTypeDef gpio_cfg,GPIO_InitStructure;
         GPIO_StructInit(&gpio_cfg);

         // vyvod ÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¨trigÃƒÆ’Ã†â€™ÃƒÂ¢Ã¢â€šÂ¬Ã…Â¡ÃƒÆ’Ã¢â‚¬Å¡Ãƒâ€šÃ‚Â¨ signala
         RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);                // PB13
         gpio_cfg.GPIO_Mode = GPIO_Mode_OUT;
         gpio_cfg.GPIO_OType = GPIO_OType_PP;
         gpio_cfg.GPIO_PuPd = GPIO_PuPd_UP;
         gpio_cfg.GPIO_Pin = GPIO_Pin_7;
         GPIO_Init(GPIOB, &gpio_cfg);
}

void dht_conv_data(void){ // convert DHT impulse lengths array into numbers and strings of T and rH
        uint8_t i, i2;
        uint16_t caps1[45], caps2[45];
        uint16_t zero_ticks, one_ticks;
        vTaskDelay(10);
        if (dht_bit_ready==1) {
                int dht_buf_pointer=DHT_DATA_START_POINTER;        // points the dht data start bit
                for (i=0;i<45;i++) {
                        caps1[i]=dht_bit_array[i];
                }
                dht_data_ready = 0;
                for (i=0; i<5; i++){
                        dht_data[i]=0;
                        vTaskDelay(10);
                        for (i2=8; i2>0; i2--) {
                                if (caps1[dht_buf_pointer]>40 && caps1[dht_buf_pointer]<80) {
                                        dht_data[i] |= (1<<(i2-1)); // set i2 bit in dht_data[i]
                                }
                                dht_buf_pointer++;
                        }
                }
                vTaskDelay(10);

                DHTValue.DHT_Humidity = dht_data[0]*256+dht_data[1];
                DHTValue.DHT_Temperature = dht_data[2]*256+dht_data[3];
                DHTValue.DHT_CRC = dht_data[5];


                vTaskDelay(10);
                dht_t_str[0] = (DHTValue.DHT_Temperature%1000)/100+48;
                dht_t_str[1] = (DHTValue.DHT_Temperature%100)/10+48;
                dht_t_str[2] = 46;
                dht_t_str[3] = (DHTValue.DHT_Temperature%10)+48;

                vTaskDelay(10);
                dht_rh_str[0] = (DHTValue.DHT_Humidity%1000)/100+48;
                dht_rh_str[1] = (DHTValue.DHT_Humidity%100)/10+48;
                dht_rh_str[2] = 46;
                dht_rh_str[3] = (DHTValue.DHT_Humidity%10)+48;

                dht_data_ready = 1;
        }
}

void Lcd_write_digit(uint8_t numb){
	/*
	if (raw>0) {
		if (numb<10) {
				Lcd_write_data(48);
				Lcd_write_data(48+numb);
		}
		else {
		     	Lcd_write_data((numb/10)+48);
		    	Lcd_write_data((numb-(numb/10)*10)+48);
		}
	}
	else { */
		if (numb<10) {
			if (lcd_pointery==0) {
				LCDLine1[lcd_pointerx++] = 48;
				LCDLine1[lcd_pointerx++] = (48+numb);
			}
			else {
				LCDLine2[lcd_pointerx++] = 48;
				LCDLine2[lcd_pointerx++] = (48+numb);
			}
		}
		else {
			if (lcd_pointery==0) {
				LCDLine1[lcd_pointerx++] = (numb/10)+48;
				LCDLine1[lcd_pointerx++] = (numb-(numb/10)*10)+48;
			}
			else {
				LCDLine2[lcd_pointerx++] = (numb/10)+48;
				LCDLine2[lcd_pointerx++] = (numb-(numb/10)*10)+48;
			}
		}

//	}

