plantalog/cadi-gcl/stm32f407/current/main.c
}

void dht_arr_displayer(void){
//        dht_get_data();
        uint8_t button=0;
        uint8_t arr_pointer=0;
        while (button!=BUTTON_OK) {
//                dht_get_data();
                vTaskDelay(30);
                Lcd_goto(0,0);
                Lcd_write_digit(arr_pointer);
                Lcd_write_str(": ");
                Lcd_write_digit((dht_bit_array[arr_pointer]/100));
                Lcd_write_digit(dht_bit_array[arr_pointer]);
                if (button_code==BUTTON_FWD) {
                        if (arr_pointer==255) {
                                arr_pointer==0;
                        }
                        else {
                                arr_pointer++;
                        }
                }
                if (button_code==BUTTON_BCK){
                        if (arr_pointer==0) {
                                arr_pointer==255;
                        }
                        else {
                                arr_pointer--;
                        }
                }
                Lcd_goto(1,0);
                Lcd_write_str("T:");
                copy_arr(&dht_t_str, &LCDLine2, 4, 2);
                Lcd_goto(1,7);
                Lcd_write_str("rH:");
                copy_arr(&dht_rh_str, &LCDLine2, 4, 10);
        }
        Lcd_clear();
}

void dht_conv_data2(void){
        uint8_t i, i2;
        uint16_t caps1[45], caps2[45];
        uint16_t zero_ticks, one_ticks;

        vTaskDelay(10);
        if (dht_bit_ready==1) {
                int dht_buf_pointer=2;
                for (i=0;i<45;i++) {
                        caps1[i]=IC1Value[i];
//                        caps2[i]=IC2Value[i];        //possibly not necessary
                }
                dht_data_ready = 0;
                for (i=0; i<5; i++){
                        dht_data[i]=0;
                        vTaskDelay(10);
                        for (i2=8; i2>0; i2--) {
                                if (caps1[dht_buf_pointer]>50 && caps1[dht_buf_pointer]<80) {
                                        dht_data[i] |= (1<<(i2-1));
                                }
                                dht_buf_pointer++;
                        }
                        DHTValue.DHT_Temperature = dht_data[0]*256+dht_data[1];
                        DHTValue.DHT_Humidity = dht_data[2]*256+dht_data[3];
                        DHTValue.DHT_CRC = dht_data[5];
                }
                dht_t_str[0] = (DHTValue.DHT_Temperature%1000)/100+48;
                dht_t_str[1] = (DHTValue.DHT_Temperature%100)/10+48;
                dht_t_str[2] = 46;
                dht_t_str[3] = (DHTValue.DHT_Temperature%10)+48;
                for (i=0;i<4;i++){
                        LCDLine1[i+5]=dht_t_str[i];
                }

                vTaskDelay(10);
                dht_rh_str[0] = (DHTValue.DHT_Humidity%1000)/100+48;
                dht_rh_str[1] = (DHTValue.DHT_Humidity%100)/10+48;
                dht_rh_str[2] = 46;
                dht_rh_str[3] = (DHTValue.DHT_Humidity%10)+48;

                for (i=0;i<4;i++){
    //                    LCDLine1[i]=dht_rh_str[i];
                }
                dht_data_ready = 1;
        }

}



void dht_get_data(void){
         //reset DHT11
        dht_init_out();
         vTaskDelay(50);
         GPIOB->BSRRH |= GPIO_Pin_7;
         vTaskDelay(120);
         GPIOB->BSRRL |= GPIO_Pin_7;
         vTaskDelay(120);
         GPIOB->BSRRH |= GPIO_Pin_7;
         dht_init();
         //start reading
         dht_bit_ready = 0;
         dht_bit_position = 0;
//         while(dht_bit_position<40){        // vozmozhna zasada v etom cikle s posledujushim zavisiom. togda nado perezapustit' cikl snova. kak variant, snizit' ciferku ozhidanija (i<38 ili kak-to tak) i mozhno dobavit' zaderzhku po vyhodu iz cikla
                 vTaskDelay(50);
//         }
         if (dht_bit_position>(38+DHT_DATA_START_POINTER)){
                 dht_bit_ready = 1;
         }
         else {
                 dht_bit_ready = 0;
         }
         vTaskDelay(5);
         dht_conv_data();
}


void TIM4_IRQHandler(void)
{
  RCC_ClocksTypeDef RCC_Clocks;
  RCC_GetClocksFreq(&RCC_Clocks);

  /* Clear TIM4 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM4, TIM_IT_CC2);

  /* Get the Input Capture value */
  dht_bit_array[dht_bit_position] = TIM_GetCapture1(TIM4)/16;
         IC1Value[dht_bit_position] = TIM_GetCapture1(TIM4)/16;
         IC2Value[dht_bit_position] = TIM_GetCapture2(TIM4)/16;
         dht_bit_position++;
}



void rtc_init(void){
        RTC_InitTypeDef RTC_InitStructure;
        uint16_t        uwLsiFreq = 32786;

         RTC_Config();
         RTC_InitStructure.RTC_AsynchPrediv = 0x7F;
         RTC_InitStructure.RTC_SynchPrediv        = (uwLsiFreq/128) - 1;
         RTC_InitStructure.RTC_HourFormat = RTC_HourFormat_24;
         RTC_Init(&RTC_InitStructure);
}



static void RTC_Config(void)
{
        RTC_InitTypeDef RTC_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Enable the PWR clock */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);

  /* Allow access to RTC */
  PWR_BackupAccessCmd(ENABLE);

  /* LSI used as RTC source clock */
  /* The RTC Clock may varies due to LSI frequency dispersion. */
  /* Enable the LSI OSC */
  RCC_LSICmd(ENABLE);

  /* Wait till LSI is ready */
  while(RCC_GetFlagStatus(RCC_FLAG_LSIRDY) == RESET)
  {
  }

  /* Select the RTC Clock Source */
  RCC_RTCCLKConfig(RCC_RTCCLKSource_LSI);

  /* Enable the RTC Clock */
  RCC_RTCCLKCmd(ENABLE);

  /* Wait for RTC APB registers synchronisation */
  RTC_WaitForSynchro();

  /* Calendar Configuration with LSI supposed at 32KHz */
  RTC_InitStructure.RTC_AsynchPrediv = 0x7F;
  RTC_InitStructure.RTC_SynchPrediv = 0xFF; /* (32KHz / 128) - 1 = 0xFF*/
  RTC_InitStructure.RTC_HourFormat = RTC_HourFormat_24;
  RTC_Init(&RTC_InitStructure);

