plantalog/cadi-gcl/stm32f407/current/main.c
                curval = JDR_BUTTONS;
                button_code = 0;
                for (i=0;i<4;i++) {
                        if (curval>button_ranges[i*2] && curval<button_ranges[i*2+1]) {
                                button_code = i+1;
                        }
                }
        }
}

extern void TIM2_IRQHandler(void)
{
    capture1 = TIM_GetCapture4(TIM2);
    capture_is_ready = 0;
    TIM_ClearITPendingBit(TIM2, TIM_IT_CC3);

}

extern void EXTI15_10_IRQHandler(void)
{
        capture2 = TIM2->CNT;
        capture_is_ready = 1;
    EXTI_ClearITPendingBit(EXTI_Line11);
}

uint8_t blinker=0;

void nrfTest(void){
	uint8_t resp=0, cmd=0;
	vTaskDelay(200);
	flush_lcd_buffer();
	Lcd_write_str_fb("Send command");
	while (button_code!=BUTTON_CNL){
	//    resp=nrfRxBuff[nrf_rx_pointer];
	    Lcd_go2(0,0);
	    vTaskDelay(20);
	    Lcd_write_str_fb("Send command");
	    Lcd_go2(1,0);
	    Lcd_write_str_fb("CMD:");
	    Lcd_print_digit(cmd);
	    Lcd_write_str_fb(" resp:");
	    Lcd_print_digit(resp);
	    vTaskDelay(20);
	    resp = NRF24_SPIx->DR;
	    if (button_code==BUTTON_FWD) {
	    	NRF24_SPIx->DR=++cmd;
	    	NRF24_CSN_LOW;
	    	SPI_I2S_ITConfig(NRF24_SPIx, SPI_I2S_IT_TXE, ENABLE);
	    }
	    if (button_code==BUTTON_BCK) {
	    	NRF24_SPIx->DR=--cmd;
	    	NRF24_CSN_LOW;
	    	SPI_I2S_ITConfig(NRF24_SPIx, SPI_I2S_IT_TXE, ENABLE);

	    }

	    if (button_code==BUTTON_OK) {
	    	NRF24_SPIx->DR=cmd;
	    	NRF24_CSN_LOW;
	    	SPI_I2S_ITConfig(NRF24_SPIx, SPI_I2S_IT_TXE, ENABLE);
	    }
	}
}

void monitorDisplayer(void){
        uint8_t i, prevseconds=0;

        NRF24_CSN_LOW;

		SPI_I2S_ITConfig(NRF24_SPIx, SPI_I2S_IT_TXE, ENABLE);
		vTaskDelay(1);
        Lcd_go2(0,3);
        Lcd_write_digit(NRF24_SPIx->DR);
        vTaskDelay(1);
        Lcd_write_digit(spi_irq_counter);
        NRF24_SPIx->DR=2;


        // --- main monitor mode programm ---
        // display temperature and humidity data
/*    for (i=0;i<4;i++){
      LCDLine1[i] = dht_t_str[i];
    }
    for (i=0;i<4;i++){
      LCDLine1[i+5] = dht_rh_str[i];
    }
         // sonar data
    for (i=0;i<3;i++){
     LCDLine1[i+11] = sonar_str[i];
    } */
    // "mm" for sonar
    for (i=0;i<16;i++) {
          LCDLine2[i]=rtc_time_now_str[i];
 //         vTaskDelay(5);
    }
 /*   LCDLine1[14]=109;
    LCDLine1[15]=109;
         // button code
    LCDLine1[9] = button_code+48;
         // date and time
*/
    RTC_GetTime(RTC_Format_BIN, &curtime);
    RTC_GetDate(RTC_Format_BIN, &curdate);
    if (curtime.RTC_Seconds!=prevseconds) {
            prevseconds=curtime.RTC_Seconds;
            rtc_time_now_str[0] = (curtime.RTC_Hours%100)/10+48;
            rtc_time_now_str[1] = curtime.RTC_Hours%10+48;
            rtc_time_now_str[2] = 58;
            rtc_time_now_str[3] = (curtime.RTC_Minutes%100)/10+48;
            vTaskDelay(1);
            rtc_time_now_str[4] = curtime.RTC_Minutes%10+48;
            rtc_time_now_str[5] = 58;
            rtc_time_now_str[6] = (curtime.RTC_Seconds%100)/10+48;
            rtc_time_now_str[7] = curtime.RTC_Seconds%10+48;
            vTaskDelay(1);
            rtc_time_now_str[8] = (curdate.RTC_Date%100)/10+48;
            rtc_time_now_str[9] = curdate.RTC_Date%10+48;
            rtc_time_now_str[10] = 45;
            rtc_time_now_str[11] = (curdate.RTC_Month%100)/10+48;
            vTaskDelay(1);
            rtc_time_now_str[12] = curdate.RTC_Month%10+48;
            rtc_time_now_str[13] = 45;
            rtc_time_now_str[14] = (curdate.RTC_Year%100)/10+48;
            rtc_time_now_str[15] = curdate.RTC_Year%10+48;
     }

}

void vTaskProgramRunner(void *pvParameters){
        uint8_t prevseconds = 0, i;
        while (1){

                monitorDisplayer();	// default foreground process

                if (button_code==BUTTON_OK)	// enter menu tree
                {
                        Lcd_clear();
                        vTaskDelay(100);
                        uint8_t progId=menuSelector();
                        programRunner(progId);
                        Lcd_clear();
                        vTaskDelay(100);
                }
                vTaskDelay(10);
        }
}

void vTaskLCDdraw(void *pvParameters) {        // draws lcd
        uint32_t tmp=0;
        uint8_t button=0, i=0;
//        RTC_TimeTypeDef curtime;
//        RTC_TimeStructInit(&curtime);
        for (;;) {
//                Lcd_write_cmd(Display_clear);
//                adc_read();

                if (i>99) {
                	i=0;
                }
                else {
                	i++;
                }
                vTaskDelay(5);
                vTaskSuspendAll();
   //             flush_lcd_buffer();
            //    Lcd_write_str("A");
                Lcd_write_cmd(0x80);	// lcd_goto(0,0)
                Lcd_write_arr(&LCDLine1, 16);
       //         xTaskResumeAll();
                //Lcd_goto(1,0);
           //     vTaskDelay(5);
      //          Delay_us(5);
        //        vTaskSuspendAll();
                Lcd_write_cmd(0x80+0x40);	// lcd_goto(1,0)
                Lcd_write_arr(&LCDLine2, 16);
                xTaskResumeAll();

                vTaskDelay(5);
                // 26.06.2013
//                button=readButtons();
        }
}



uint16_t del;
void vTaskLED5(void *pvParameters) {
        for (;;) {
                STM32F4_Discovery_LEDOn(LED5);
                vTaskDelay(5);
                STM32F4_Discovery_LEDOff(LED5);
                del = 65-sonar_value/1000;
                vTaskDelay(del);
        }
}

void vTaskLED6(void *pvParameters) {
        uint8_t i=0, prevseconds=0;
        for (;;) {
                STM32F4_Discovery_LEDOn(LED6);
                vTaskDelay(2);
                STM32F4_Discovery_LEDOff(LED6);
                vTaskDelay(2);
                RTC_GetTime(RTC_Format_BIN, &curtime);
                RTC_GetDate(RTC_Format_BIN, &curdate);
                vTaskDelay(5);

