plantalog/cadi-gcl/stm32f407/current/main.c
                vTaskDelay(5);
        }
}

uint16_t uint16_time_diff(uint16_t now, uint16_t before)
{
  return (now >= before) ? (now - before) : (UINT16_MAX - before + now);
}

void vTaskDHT(void *pvParameters){
        uint8_t i=0;
        dht_bit_position=0;
        while (1) {
                dht_get_data();
                vTaskDelay(30);
        }
}

void vTaskSDLog(void *pvParameters){
        while (1){
                vTaskDelay(200);
                logString[0] = (curtime.RTC_Hours%100)/10+48;
                logString[1] = curtime.RTC_Hours%10+48;
                logString[2] = 58;
                logString[3] = (curtime.RTC_Minutes%100)/10+48;
                vTaskDelay(5);
                logString[4] = curtime.RTC_Minutes%10+48;
                logString[5] = 58;
                logString[6] = (curtime.RTC_Seconds%100)/10+48;
                logString[7] = curtime.RTC_Seconds%10+48;
                logString[8] = 32;
                vTaskDelay(5);
                logString[9] = (curdate.RTC_Date%100)/10+48;
                logString[10] = curdate.RTC_Date%10+48;
                logString[11] = 45;
                logString[12] = (curdate.RTC_Month%100)/10+48;
                vTaskDelay(5);
                logString[13] = curdate.RTC_Month%10+48;
                logString[14] = 45;
                logString[15] = (curdate.RTC_Year%100)/10+48;
                logString[16] = curdate.RTC_Year%10+48;
                logString[17] = 32;
                copy_arr(&sonar_str, &logString, 5, 18);
                logString[23] = 32;
                copy_arr(&dht_rh_str, &logString, 4, 24);
                logString[28] = 32;
                copy_arr(&dht_t_str, &logString, 4, 29);
         logString[33] = 10;                // LF perenos stroki
         string2log(&logString, 34);
        }
}

void vTaskSonar(void *pvParameters){
        uint8_t        i=0;
        for (;;) {
                 sonar_trig();
                 vTaskDelay(10);
         sonar_value = (65535-uint16_time_diff(capture1,capture2))/80; // get millimeters
         sonar_str[0] = (sonar_value%1000)/100+48;
         sonar_str[1] = (sonar_value%100)/10+48;
         sonar_str[2] = (sonar_value%10)+48;
         sonar_str[3] = 32;
         vTaskDelay(10);
        }

}

void copy_arr(uint8_t *source, uint8_t *destination, uint8_t amount, uint8_t pos){
        int i=0;
        for (i=0; i<amount;i++) {
                destination[i+pos] = source[i];
        }
}


FRESULT string2log(char* str, int amount){
        uint8_t res=0; //Ã�Â´Ã�Â»Ã‘ï¿½ Ã�Â²Ã�Â¾Ã�Â·Ã�Â²Ã‘â‚¬Ã�Â°Ã‘â€°Ã�Â°Ã�ÂµÃ�Â¼Ã�Â¾Ã�Â³Ã�Â¾ Ã‘â€žÃ‘Æ’Ã�Â½Ã�ÂºÃ‘â€ Ã�Â¸Ã‘ï¿½Ã�Â¼Ã�Â¸ Ã‘â‚¬Ã�ÂµÃ�Â·Ã‘Æ’Ã�Â»Ã‘Å’Ã‘â€šÃ�Â°Ã‘â€šÃ�Â°
        UINT len; //Ã�Â´Ã�Â»Ã‘ï¿½ Ã‘â€¦Ã‘â‚¬Ã�Â°Ã�Â½Ã�ÂµÃ�Â½Ã�Â¸Ã‘ï¿½ Ã�ÂºÃ�Â¾Ã�Â»Ã�Â¸Ã‘â€¡Ã�ÂµÃ‘ï¿½Ã‘â€šÃ�Â²Ã�Â° Ã‘â‚¬Ã�ÂµÃ�Â°Ã�Â»Ã‘Å’Ã�Â½Ã�Â¾ Ã�Â·Ã�Â°Ã�Â¿Ã�Â¸Ã‘ï¿½Ã�Â°Ã�Â½Ã�Â½Ã‘â€¹Ã‘â€¦ Ã�Â±Ã�Â°Ã�Â¹Ã‘â€š
        f_write(&cadizlog, str, amount, &len);
        f_sync(&cadizlog);
        return res;
}



void loadSettings(){        //
        uint16_t i, Address, Data;
        uint32_t tmp;
        char tmpstr[11], putstring[50];
//        char *massiv[];
        for (i=0; i<PLUG_AMOUNT; i++) {
                Address=EE_PLUG_SETTINGS+i;
                EE_ReadVariable(Address, &Data);
                plugSettings[i]=Data;
                if (no_sd>1) {
                        string2log("plug no.", 8);
                        int32str(i,&tmpstr);
                        string2log(tmpstr, 11);
                        string2log(" has timer no.", 14);
                        int32str(plugSettings[i],&tmpstr);
                        tmpstr[10] = 0x0A;
                        string2log(tmpstr, 11);
                }
        }
        Address=LIGHT_RANGE_ADDR;
        EE_ReadVariable(Address, &lightRange);
        EE_ReadVariable(PH4_ADDR, &ph4);

//        Address=PH7_ADDR;
        EE_ReadVariable(PH7_ADDR, &ph_seven);
        cdel = (ph_seven - ph4)/3;
        ph0 = ph4 - cdel*4;

        if (no_sd>0) {
                // vnesti v log znachenie kalibrovshika ph4
                int32str(ph4,&tmpstr);
                for (i=0;i<10;i++){
                        putstring[i]=tmpstr[i];
                }
                putstring[10] = 0x0A;
                string2log("ph4 cal @ ", 10);
                string2log(putstring, 11);

                // vnesti v log znachenie kalibrovshika ph7
                int32str(ph_seven,&tmpstr);
                for (i=0;i<10;i++){
                        putstring[i]=tmpstr[i];
                }
                putstring[10] = 0x0A;
                string2log("ph7 cal @ ", 10);
                string2log(putstring, 11);

                // vnesti v log raschitayj uroven' ph0
                int32str(ph0,&tmpstr);
                for (i=0;i<10;i++){
                        putstring[i]=tmpstr[i];
                }
                putstring[14] = 10;
                string2log("ph0 counted @ ", 14);
                string2log(putstring, 11);

                // vnesti v log raschitanuju cenu delenija
                int32str(cdel,&tmpstr);
                for (i=0;i<10;i++){
                        putstring[i]=tmpstr[i];
                }
                putstring[14] = 10;
                string2log("cena delenija ", 14);
                string2log(putstring, 11);
        }

        EE_ReadVariable(SD_LOG_INTERVAL, &logInterval);
}


char* int32str(uint32_t d, char* out)
{
    out[10] = '\0';
    out[9] = '0' + ( d ) % 10;
    out[8] = '0' + ( d /= 10 ) % 10;
    out[7] = '0' + ( d /= 10 ) % 10;
    out[6] = '0' + ( d /= 10 ) % 10;
    out[5] = '0' + ( d /= 10 ) % 10;
    out[4] = '0' + ( d /= 10 ) % 10;
    out[3] = '0' + ( d /= 10 ) % 10;
    out[2] = '0' + ( d /= 10 ) % 10;
    out[1] = '0' + ( d /= 10 ) % 10;
    out[0] = '0' + ( d / 10 ) % 10;
    return out;
}

void buttonCalibration(void){        // buttons calibration function
        uint16_t button_val[4], diff;
        Lcd_clear();
        Lcd_goto(0,0);
        Lcd_write_arr("<", 1);
        Delay_us(10000);
        adc_read();
        Delay_us(100);
        button_val[0] = JDR_BUTTONS;
        Lcd_goto(0,0);
        Lcd_write_arr("OK", 2);
        Delay_us(10000);
        adc_read();
        Delay_us(100);
        button_val[1] = JDR_BUTTONS;
        Lcd_goto(0,0);
        Lcd_write_arr("CANCEL", 6);
        Delay_us(10000);
        adc_read();
        Delay_us(100);
        Lcd_clear();
        button_val[2] = JDR_BUTTONS;
        Lcd_goto(0,0);
        Lcd_write_arr(">", 1);
        Delay_us(10000);
        adc_read();
        Delay_us(100);
        button_val[3] = JDR_BUTTONS;

